/*
项目名称：字符串查找 
作者：张娅蕾 
学号：202010420127
班级：网工一班 
编程语言：C语言 
日期：2021/03/20
目的：在字符串S1里找字符串S2,存在则返回S2,不存在则返回-1 
*/

#include<stdio.h>                         //标准输入输出 
#include<string.h>                        //调用strlen()函数 

int main()
{
	int i,j=0;                                    //自定义变量i,j,并初始化j 
	int len1,len2;                                //自定义整型变量len1,len2 
	char s1[20],s2[20],s[i];                      //自定义字符型数组s1,s2用于储存输入字符串,数组s用于临时储存数组 
	
	printf("请输入字符串s1和s2:\n");                      //打印
	scanf("%s%s",s1,s2);                                  //输入字符串s1,s2 
	
	len1=strlen(s1);                               //计算字符串s1的长度 
	len2=strlen(s2);                               //计算字符串s2的长度 
	
    //for循环用于判断字符串S1中是否存在字符串S2 
	for(i=0;i<len2;i++)
	{
		while(s1[j]!=s2[i]&&j<len1)                   //当字符串s1和字符串s2中对应字符不相等并且j小于字符串s1的长度做while循环 
		{
		j++;                                    //j自增,指向数组s1的下一位 
    	}
    	if(s1[j]==s2[i])                          //如果检测到s1和s2有相等字符时执行if语句 
    	s[i]=s2[i];                               //将数组s2中第i位暂存在数组s第i位中,最后用于整体打印字符串 
    	if(j==len1)                               //如果检测到j等于字符串s1的长度时执行if语句 
    	printf("-1\n");                           //屏幕上打印-1 
    	j++;                                      //j自增,指向数组s1的下一位 
	 } 
	 
	 //if语句用于输出s2字符串 
	 if(j<=len1)                               //当j小于等于字符串s1的长度时执行if语句 
	 {
	 	for(i=0;i<len2;i++)                    //for循环用于打印字符串s2 
	 printf("%c",s[i]);                        //屏幕上打印字符串s2 
     }
     
	return 0;
} 
